ValidationModel/0.orig/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2112                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 600;

boundaryField
{
    hotWall
    {
        type            fixedValue;
        value           uniform 960;
    }

    coldWall
    {   
        type            fixedValue;
        value           uniform 240;
        //type            lumpedMassWallTemperature;
        //kappaMethod     fluidThermo;
        //kappa           none;
        //mass            1000;
        //Cp              4100;
        //value           uniform 300;
    }

    topFloor
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
