ValidationModel/0.orig/alphat
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2112                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      alphat;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{   
    wall
    {
        type            compressible::alphatWallFunction;
        value           uniform 0;
    }
    /*
    floor
    {
        type            compressible::alphatWallFunction;
        value           uniform 0;
    }

    ceiling
    {
        type            compressible::alphatWallFunction;
        value           uniform 0;
    }

    fixedWalls
    {
        type            compressible::alphatWallFunction;
        value           uniform 0;
    }
    */
}


// ************************************************************************* //
