ValidationModel/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2112                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   0.06706622;

vertices
(
    (0 0 0)
    (1 0 0)
    (1 1 0)
    (0 1 0)
    (0 0 0.1)
    (1 0 0.1)
    (1 1 0.1)
    (0 1 0.1)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (300 300 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    topFloor
    {
        type wall;
        faces
        (
            (1 5 4 0) //Floor
            (3 7 6 2) //top
        );
    }
    frontBack
    {
        type empty;
        faces
        (
            (0 3 2 1) //Back
            (4 5 6 7) //Front
        );
    }
    hotWall
    {
        type wall;
        faces
        (
            (0 4 7 3) //hot
        );
    }
    coldWall
    {
        type wall;
        faces
        (
            (2 6 5 1) //cold
        );
    }
);

mergePatchPairs
(
);


// ************************************************************************* //
